stm32duino/STM32Ethernet/src/utility/stm32_eth.cpp
/**
  ******************************************************************************
  * @file    stm32_eth.cpp
  * @author  WI6LABS
  * @version V1.0.0
  * @date    24-May-2017
  * @brief   This file implements Ethernet network interface drivers for
  *          Arduino STM32Ethernet library.
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; COPYRIGHT(c) 2016 STMicroelectronics</center></h2>
  *
  * Redistribution and use in source and binary forms, with or without modification,
  * are permitted provided that the following conditions are met:
  *   1. Redistributions of source code must retain the above copyright notice,
  *      this list of conditions and the following disclaimer.
  *   2. Redistributions in binary form must reproduce the above copyright notice,
  *      this list of conditions and the following disclaimer in the documentation
  *      and/or other materials provided with the distribution.
  *   3. Neither the name of STMicroelectronics nor the names of its contributors
  *      may be used to endorse or promote products derived from this software
  *      without specific prior written permission.
  *
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
  * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
  * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
  * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
  * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
  * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
  * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
  * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
  * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
  * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *
  ******************************************************************************
  */

#include "Arduino.h"
#include "stm32_eth.h"
#include "lwip/init.h"
#include "lwip/netif.h"
#include "lwip/timeouts.h"
#include "netif/ethernet.h"
#include "ethernetif.h"
#include "lwip/dhcp.h"
#include "lwip/prot/dhcp.h"
#include "lwip/dns.h"

/* Check ethernet link status every seconds */
#define TIME_CHECK_ETH_LINK_STATE 500U

/* Timeout for DNS request */
#define TIMEOUT_DNS_REQUEST 10000U

/* Maximum number of retries for DHCP request */
#define MAX_DHCP_TRIES  4

/*
 * Defined a default timer used to call ethernet scheduler at regular interval
 * Could be redefined in the variant
 * Note: This is planned to extend Timer API's of the Arduino STM32 core
 *       They could be used for this library when available
 */
#ifndef DEFAULT_ETHERNET_TIMER
  #define DEFAULT_ETHERNET_TIMER  TIM14
  #warning "Default timer used to call ethernet scheduler at regular interval: TIM14"
#endif

/* Interrupt priority */
#ifndef ETH_TIM_IRQ_PRIO
  #define ETH_TIM_IRQ_PRIO       15 // Warning: it should be lower prio (higher value) than Systick
#endif
#ifndef ETH_TIM_IRQ_SUBPRIO
  #define ETH_TIM_IRQ_SUBPRIO    0
#endif
/* Ethernet configuration: user parameters */
struct stm32_eth_config {
  ip_addr_t ipaddr;
  ip_addr_t netmask;
  ip_addr_t gw;
};

/* Use to give user parameters to netif configuration */
static struct stm32_eth_config gconfig;

/* Netif global configuration structure */
struct netif gnetif;

/* DHCP periodic timer */
static uint32_t DHCPfineTimer = 0;

/* DHCP current state */
__IO uint8_t DHCP_state = DHCP_OFF;

/* Set to 1 if user use DHCP to obtain network addresses */
static uint8_t DHCP_Started_by_user = 0;

/* Ethernet link status periodic timer */
static uint32_t gEhtLinkTickStart = 0;

#if !defined(STM32_CORE_VERSION) || (STM32_CORE_VERSION  <= 0x01060100)
  /* Handler for stimer */
  static stimer_t TimHandle;
#else
  HardwareTimer *EthTim = NULL;
#endif

/*************************** Function prototype *******************************/
static void Netif_Config(void);
static err_t tcp_recv_callback(void *arg, struct tcp_pcb *tpcb, struct pbuf *p, err_t err);
static err_t tcp_sent_callback(void *arg, struct tcp_pcb *tpcb, u16_t len);
static void tcp_err_callback(void *arg, err_t err);
static void TIM_scheduler_Config(void);
#if defined(STM32_CORE_VERSION) && (STM32_CORE_VERSION  > 0x01060100)
  void _stm32_eth_scheduler(void);
#endif

/**
* @brief  Configure the network interface
* @param  None
* @retval None
*/
static void Netif_Config(void)
{
  netif_remove(&gnetif);
  /* Add the network interface */
  netif_add(&gnetif, &(gconfig.ipaddr), &(gconfig.netmask), &(gconfig.gw), NULL, &ethernetif_init, &ethernet_input);

  /* Registers the default network interface */
  netif_set_default(&gnetif);

  if (netif_is_link_up(&gnetif)) {
    /* When the netif is fully configured this function must be called */
    netif_set_up(&gnetif);
  } else {
    /* When the netif link is down this function must be called */
    netif_set_down(&gnetif);
  }

#if LWIP_NETIF_LINK_CALLBACK
  /* Set the link callback function, this function is called on change of link status */
  netif_set_link_callback(&gnetif, ethernetif_update_config);
#endif /* LWIP_NETIF_LINK_CALLBACK */
}

/**
* @brief  Scheduler callback. Call by a timer interrupt.
* @param  htim: pointer to stimer_t or Hardware Timer
* @retval None
*/
#if !defined(STM32_CORE_VERSION) || (STM32_CORE_VERSION  <= 0x01060100)
  static void scheduler_callback(stimer_t *htim)
#elif (STM32_CORE_VERSION  <= 0x01080000)
  static void scheduler_callback(HardwareTimer *htim)
#else
  static void scheduler_callback(void)
#endif
{
#if (STM32_CORE_VERSION  <= 0x01080000)
  UNUSED(htim);
#endif
  _stm32_eth_scheduler();
}

#if !defined(STM32_CORE_VERSION) || (STM32_CORE_VERSION  <= 0x01060100)
/**
* @brief  Enable the timer used to call ethernet scheduler function at regular
*         interval.
* @param  None
* @retval None
*/
static void TIM_scheduler_Config(void)
{
  /* Set TIMx instance. */
  TimHandle.timer = DEFAULT_ETHERNET_TIMER;
  /* Timer set to 1ms */
  TimerHandleInit(&TimHandle, (uint16_t)(1000 - 1), ((uint32_t)(getTimerClkFreq(DEFAULT_ETHERNET_TIMER) / (1000000)) - 1));
  attachIntHandle(&TimHandle, scheduler_callback);
}
#else
/**
* @brief  Enable the timer used to call ethernet scheduler function at regular
*         interval.
* @param  None
* @retval None
*/
static void TIM_scheduler_Config(void)
{
  /* Configure HardwareTimer */
  EthTim = new HardwareTimer(DEFAULT_ETHERNET_TIMER);
  EthTim->setInterruptPriority(ETH_TIM_IRQ_PRIO, ETH_TIM_IRQ_SUBPRIO);
  EthTim->setMode(1, TIMER_OUTPUT_COMPARE);

