stm32duino/STM32Ethernet/src/utility/stm32_eth.cpp
  /* Timer set to 1ms */
  EthTim->setOverflow(1000, MICROSEC_FORMAT);
  EthTim->attachInterrupt(scheduler_callback);
  EthTim->resume();
}
#endif

void stm32_eth_init(const uint8_t *mac, const uint8_t *ip, const uint8_t *gw, const uint8_t *netmask)
{
  static uint8_t initDone = 0;

  if (!initDone) {
    /* Initialize the LwIP stack */
    lwip_init();
  }

  if (mac != NULL) {
    ethernetif_set_mac_addr(mac);
  } // else default value is used: MAC_ADDR0 ... MAC_ADDR5

  if (ip != NULL) {
    IP_ADDR4(&(gconfig.ipaddr), ip[0], ip[1], ip[2], ip[3]);
  } else {
#if LWIP_DHCP
    ip_addr_set_zero_ip4(&(gconfig.ipaddr));
#else
    IP_ADDR4(&(gconfig.ipaddr), IP_ADDR0, IP_ADDR1, IP_ADDR2, IP_ADDR3);
#endif /* LWIP_DHCP */
  }

  if (gw != NULL) {
    IP_ADDR4(&(gconfig.gw), gw[0], gw[1], gw[2], gw[3]);
  } else {
#if LWIP_DHCP
    ip_addr_set_zero_ip4(&(gconfig.gw));
#else
    IP_ADDR4(&(gconfig.gw), GW_ADDR0, GW_ADDR1, GW_ADDR2, GW_ADDR3);
#endif /* LWIP_DHCP */
  }

  if (netmask != NULL) {
    IP_ADDR4(&(gconfig.netmask), netmask[0], netmask[1], netmask[2], netmask[3]);
  } else {
#if LWIP_DHCP
    ip_addr_set_zero_ip4(&(gconfig.netmask));
#else
    IP_ADDR4(&(gconfig.netmask), NETMASK_ADDR0, NETMASK_ADDR1, NETMASK_ADDR2, NETMASK_ADDR3);
#endif /* LWIP_DHCP */
  }

  /* Configure the Network interface */
  Netif_Config();

  if (!initDone) {
    // stm32_eth_scheduler() will be called every 1ms.
    TIM_scheduler_Config();
    initDone = 1;
  }

  /* Reset DHCP if used */
  User_notification(&gnetif);

  /* Update LwIP stack */
  stm32_eth_scheduler();
}

/**
  * @brief Return Ethernet init status
  * @param  None
  * @retval 1 for initialized, 0 for not initialized
  */
uint8_t stm32_eth_is_init(void)
{
  return ethernetif_is_init();
}

/**
  * @brief Set Ethernet MAC address
  * @param  mac: mac address
  * @retval None
  */
void stm32_eth_set_macaddr(const uint8_t *mac)
{
  ethernetif_set_mac_addr(mac);
}
/**
  * @brief Return Ethernet MAC address
  * @param  mac: mac address
  * @retval None
  */
void stm32_eth_get_macaddr(uint8_t *mac)
{
  return ethernetif_get_mac_addr(mac);
}

/**
  * @brief Return Ethernet link status
  * @param  None
  * @retval 1 for link up, 0 for link down
  */
uint8_t stm32_eth_link_up(void)
{
  return netif_is_link_up(&gnetif);
}

#if defined(STM32_CORE_VERSION) && (STM32_CORE_VERSION  > 0x01060100)
/**
  * @brief  This function generates Timer Update event to force call to _stm32_eth_scheduler().
  * @param  None
  * @retval None
  */
void stm32_eth_scheduler(void)
{
  if (EthTim != NULL) {
    EthTim->refresh();
  }
}

/**
  * @brief  This function is called solely by Timer callback to avoid race condition.
  * @param  None
  * @retval None
  */
void _stm32_eth_scheduler(void)
#else
/**
  * @brief  This function is called solely by Timer callback to avoid race condition.
  * @param  None
  * @retval None
  */
void stm32_eth_scheduler(void)
#endif
{
  /* Read a received packet from the Ethernet buffers and send it
  to the lwIP for handling */
#ifndef ETH_INPUT_USE_IT
  ethernetif_input(&gnetif);
#endif /* ETH_INPUT_USE_IT */

  /* Check ethernet link status */
  if ((HAL_GetTick() - gEhtLinkTickStart) >= TIME_CHECK_ETH_LINK_STATE) {
    ethernetif_set_link(&gnetif);
    gEhtLinkTickStart = HAL_GetTick();
  }

  /* Handle LwIP timeouts */
  sys_check_timeouts();

#if LWIP_DHCP
  stm32_DHCP_Periodic_Handle(&gnetif);
#endif /* LWIP_DHCP */
}

#if LWIP_DHCP

/**
  * @brief  Returns DHCP activation state
  * @param  None
  * @retval true if DHCP enabled or false if not used
  */
uint8_t stm32_dhcp_started(void)
{
  return DHCP_Started_by_user;
}

/**
  * @brief  DHCP_Process_Handle
  * @param  netif pointer to generic data structure used for all lwIP network interfaces
  * @retval None
  */
void stm32_DHCP_process(struct netif *netif)
{
  struct dhcp *dhcp;

  if (netif_is_link_up(netif)) {
    switch (DHCP_state) {
      case DHCP_START: {
          ip_addr_set_zero_ip4(&netif->ip_addr);
          ip_addr_set_zero_ip4(&netif->netmask);
          ip_addr_set_zero_ip4(&netif->gw);
          DHCP_state = DHCP_WAIT_ADDRESS;
          dhcp_start(netif);
          DHCP_Started_by_user = 1;
        }
        break;

      case DHCP_WAIT_ADDRESS: {
          if (dhcp_supplied_address(netif)) {
            DHCP_state = DHCP_ADDRESS_ASSIGNED;
          } else {
            dhcp = (struct dhcp *)netif_get_client_data(netif, LWIP_NETIF_CLIENT_DATA_INDEX_DHCP);

            /* DHCP timeout */
            if (dhcp->tries > MAX_DHCP_TRIES) {
              DHCP_state = DHCP_TIMEOUT;

              // If DHCP address not bind, keep DHCP stopped
              DHCP_Started_by_user = 0;

              /* Stop DHCP */
              dhcp_stop(netif);
            }
          }
        }
        break;
      case DHCP_ASK_RELEASE: {
          /* Force release */
          dhcp_release(netif);
          dhcp_stop(netif);
          DHCP_state = DHCP_OFF;
        }
        break;
      case DHCP_LINK_DOWN: {
          /* Stop DHCP */
          dhcp_stop(netif);
          DHCP_state = DHCP_OFF;
        }
        break;
      default: break;
    }
  } else {
    DHCP_state = DHCP_OFF;
  }
}

/**
  * @brief  DHCP periodic check
  * @param  netif pointer to generic data structure used for all lwIP network interfaces
  * @retval None
  */
void stm32_DHCP_Periodic_Handle(struct netif *netif)
{
  /* Fine DHCP periodic process every 500ms */
  if (HAL_GetTick() - DHCPfineTimer >= DHCP_FINE_TIMER_MSECS) {
    DHCPfineTimer =  HAL_GetTick();
    /* process DHCP state machine */
    stm32_DHCP_process(netif);
  }
}

/**
  * @brief  Inform the local DHCP of our manual IP configuration
  * @param  None
  * @retval None
  */
void stm32_DHCP_manual_config(void)
{
  dhcp_inform(&gnetif);
}

/**
  * @brief  Return status of the DHCP when renew or rebind
  * @param  None
  * @retval Renew or rebind. Adapted from Arduino Ethernet library.
  */
uint8_t stm32_get_DHCP_lease_state(void)
{
  uint8_t res = 0;
  struct dhcp *dhcp = (struct dhcp *)netif_get_client_data(&gnetif, LWIP_NETIF_CLIENT_DATA_INDEX_DHCP);

  if (dhcp->state == DHCP_STATE_RENEWING) {
    res = 2;
  } else if (dhcp->state == DHCP_STATE_REBINDING) {
    res = 4;
  }

  return res;
}

/**
  * @brief  Set DHCP state
  * @param  state: DHCP_START, DHCP_ASK_RELEASE or DHCP_STOP. Others should not be used.
  * @retval None
  */
void stm32_set_DHCP_state(uint8_t state)
{
  DHCP_state = state;
}

/**
  * @brief  Return DHCP state
  * @param  None
  * @retval One of the following state:
              DHCP_OFF
              DHCP_START
              DHCP_WAIT_ADDRESS
              DHCP_ADDRESS_ASSIGNED
              DHCP_TIMEOUT
              DHCP_LINK_DOWN
              DHCP_ASK_RELEASE
  */
uint8_t stm32_get_DHCP_state(void)
{
  return DHCP_state;
}

#endif /* LWIP_DHCP */

/**
  * @brief  Converts IP address in readable format for user.
  * @param  None
  * @retval address in uint32_t format
  */
uint32_t stm32_eth_get_ipaddr(void)
{
  return ip4_addr_get_u32(&(gnetif.ip_addr));
}

/**
  * @brief  Converts gateway address in readable format for user.
  * @param  None
  * @retval address in uint32_t format
  */
uint32_t stm32_eth_get_gwaddr(void)
{
  return ip4_addr_get_u32(&(gnetif.gw));
}

/**
  * @brief  Converts network mask address in readable format for user.
  * @param  None
  * @retval address in uint32_t format
  */
uint32_t stm32_eth_get_netmaskaddr(void)
{
  return ip4_addr_get_u32(&(gnetif.netmask));
}

/**
  * @brief  Converts DNS address in readable format for user.
  * @param  None
  * @retval address in uint32_t format
  */
uint32_t stm32_eth_get_dnsaddr(void)
{
  const ip_addr_t *tmp = dns_getserver(0);
  return ip4_addr_get_u32(tmp);
}

/**
  * @brief  Converts DHCP address in readable format for user.
  * @param  None
  * @retval address in uint32_t format
  */
uint32_t stm32_eth_get_dhcpaddr(void)
{
  struct dhcp *dhcp = (struct dhcp *)netif_get_client_data(&gnetif, LWIP_NETIF_CLIENT_DATA_INDEX_DHCP);
  return ip4_addr_get_u32(&(dhcp->server_ip_addr));
}

#if LWIP_NETIF_LINK_CALLBACK

/**
  * @brief  This function notify user about link status changement.
  * @param  netif: the network interface
  * @retval None
  */
void ethernetif_notify_conn_changed(struct netif *netif)
{
  if (netif_is_link_up(netif)) {
    /* Update DHCP state machine if DHCP used */
    if (DHCP_Started_by_user == 1) {
      DHCP_state = DHCP_START;
    }

